app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function listUsers() {
        // Call user model and fetch all users from users table in database
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

INSERT INTO `users` (`first_name`, `middle_name`, `last_name`, `age`, `gender_id`, `email`, `password`) VALUES ('Adrian', 'Albania', 'Roxas', '21', '1', 'adrianroxas155@gmail.com', '58e71360c3359fdde64fef0b005892eb85443391')
---

                // Call user model to save the user in users table in database
                $userModel = new UserModel();
                $userModel->save($post);

SELECT *
FROM `genders`
---

        // Call gender model and fetch all genders value from genders table in database
        $genderModel = new GenderModel();
        $data['genders'] = $genderModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'
DELETE FROM `users`
WHERE `user_id` IN ('1')
---
    public function deleteUser($id) {
        //Select one user from table
        $userModel = new UserModel();
        $data['users'] = $userModel->find($id);

        //When delete button is clicked
        if ($this->request->getMethod() == 'post') {
            $userModel->delete($id);